<?php

/**
 * URL解析规则
 */

return [

    /***********************下面写你自己的URL解析规则********************/

    /***********************栏目测试规则：栏目列表页面分页的伪静态解析*************************/
    "html\/list\-([\w]+)\-([0-9]+).html(.*)"  => 'index.php?m=content&c=index&a=lists&catdir=$1&page=$2',

    /***********************栏目测试规则：栏目列表页面的伪静态解析*************************/
    "html\/list\-([\w]+).html(.*)"  => 'index.php?m=content&c=index&a=lists&catdir=$1',

    /***********************内容测试规则：内容页面分页的伪静态解析*************************/
    "html\/show\-([\w]+)\-([0-9]+)\-([0-9]+).html(.*)"  => 'index.php?m=content&c=index&a=show&catdir=$1&id=$2&page=$3',

    /***********************内容测试规则：内容页面的伪静态解析*************************/
    "html\/show\-([\w]+)\-([0-9]+).html(.*)"  => 'index.php?m=content&c=index&a=show&catdir=$1&id=$2',


];